data = """
1分で話せ 世界のトップが絶賛した大事なことだけシンプルに伝える技術
1日1ページ、読むだけで身につく世界の教養365
伝える力
amazon 世界最先端、最高の戦略
嫌われる勇気
生き方 人間として一番大事な事
Excel 最強の教科書 すぐに使えて、一生役立つ「成果を生み出す」超エクセル仕事術
AI VS. 教科書が読めない子どもたち
10年後の仕事図鑑
稲盛和夫の実学 経営と会計
漫画 君たちはどう生きるか
お金2.0 新しい経済のルールと生き方
ライフハック大全 人生と仕事を変える小さな習慣250
逆説の日本史
これからの「正義」の話をしよう
いまさら聞けない　ビットコインとブロックチェーン
ワーク・シフト　孤独と貧困から自由になる働き方の未来図＜2025＞
メモの魔力
ロジカル・シンキング
筋トレをする人は、なぜ、仕事で結果を出せるのか？
RPAの威力
道をひらく
バカとつき合うな
死ぬこと以外かすり傷
言葉にできるは武器になる。
サピエンス全史
アイデアのちから
GIVE & TAKE 「与える人」こそ成功する時代
反応しない練習　あらゆる悩みが消えていくブッダの超・合理的な「考え方」
原因と結果の法則
シンプルに考える
「読む力」と「地頭力」がいっきに身につく　東大読書
ゼロ
一流の人はなぜ風邪をひかないのか？
LIFE SHIFT
失敗学のすすめ
革命のファンファーレ 現代のお金と広告
スティーブ・ジョブズ 驚異のプレゼン 人々を惹きつける18の法則
自分を操る超集中力
人を動かす
日本の論点2019～20
プロフェッショナルの条件
チーズはどこへ消えた
お金は愛
伝え方が9割
このまま今の会社にいていいのか？と一度でも思ったら読む 転職の思考法
「イノベーターのジレンマ」の経済学的解明
なぜ倒産　23社の破綻に学ぶ失敗の法則
人生は、運よりも実力よりも「勘違いさせる力」で決まっている
超筋トレが最強のソリューションである　筋肉が人生を変える超科学的な理由
イシューからはじめよ 知的生産の「シンプルな本質」
「死」とは何か？ イェール大学で23年連続の人気講義
0才から100才まで学び続けなくてはならない時代を生きる学ぶ人と育てる人のための教科書
やり抜く力
会計の世界史 イタリア、イギリス、アメリカ 500年の物語
ゴーン・ショック！　事件の背後にある国家戦略と世界経済の行方
スタンフォード式　最高の睡眠
ユダヤ人大富豪の教え
ザ・ゴール
天才とは努力を続けられる人のことであり、それには方法論がある。
「ラクして速い」が一番すごい
佐藤可士和の超整理術
ストーリーとしての競争戦略 優れた戦略の条件
トヨタ生産方式
AIとBIはいかに人間を変えるのか
スティーブ・ジョブズ 驚異のプレゼン 人々を惹きつける18の法則
こうして、思考は現実になる
年収1億円になる人の習慣
すいません、ほぼ日の経営。
誰も教えてくれない 考えるスキル
the four GAFA　四騎士が創り変えた世界
20歳のときに知っておきたかったこと　スタンフォード大学集中講義
ウォール街のランダム・ウォーカー
道は開ける
新世界
日本再興戦略
人を操る禁断の文章術
ドラッカー名著集
マネジメント エッセンシャル版 基本と原則
未来の年表 人口減少日本でこれから起きること
ポジティブ・チェンジ
考具 考えるための道具、持っていますか
マネジャーの最も大切な仕事 95%の人が見過ごす「小さな進捗」の力
ホモ・デウス テクノロジーとサピエンスの未来
独学プログラマー Python言語の基本から仕事のやり方まで
スタンフォードの自分を変える教室
武器になる哲学 人生を生き抜くための哲学・思想のキーコンセプト50
スタンフォード式　疲れない体
仮説思考 BCG流 問題発見・解決の発想法
世界のエリートはなぜ「美意識」を鍛えるのか？～経営における「アート」と「サイエンス」～
ゼロ秒思考
一人の力で日経平均を動かせる男の投資哲学
実戦マーケティング戦略
失敗の本質 日本軍の組織論的研究
ビジョナリー・カンパニー 時代を超える生存の原則
学びを結果に変えるアウトプット大全
LIFE SHIFT
USJのジェットコースターはなぜ後ろ向きに走ったのか?
10年後の仕事図鑑
日本再興戦略
人生の勝算
メモの魔力
金持ち父さん貧乏父さん アメリカの金持ちが教えてくれるお金の哲学
センスは知識からはじまる
ホモ・デウス テクノロジーとサピエンスの未来
死ぬこと以外かすり傷
USJを劇的に変えた、たった1つの考え方 成功を引き寄せるマーケティング入門
ジョブ理論 イノベーションを予測可能にする消費のメカニズム
エッセンシャル思考 最少の時間で成果を最大にする
武器になる哲学 人生を生き抜くための哲学・思想のキーコンセプト50
サピエンス全史
シン・ニホン
戦略プロフェッショナル
マーケット感覚を身につけよう 「これから何が売れるのか?」わかる人になる5つの方法
破天荒フェニックス
新・魔法のコンパス
神・時間術
複業の教科書
独学の技法
自分の小さな「箱」から脱出する方法
嫌われる勇気
ミライの授業
道は開ける
影響力の武器 なぜ、人は動かされるのか
仕事は楽しいかね
人を動かす
読んだら忘れない読書術
ポジティブ・チェンジ
人生は手帳で変わる 3週間実践ワークブック
人生が変わるお金の大事な話 「稼ぐ×貯まる×増える」のヒミツ
絶対達成マインドの作り方
小説でわかる名著 経営者の条件 人生を変えるドラッカー
ゼロ
amazon 世界最先端、最高の戦略
学びを結果に変えるアウトプット大全
人生と財産
孫子
私はどうして販売外交に成功したのか
ネクスト・ソサエティー 歴史が見たことのない未来が始まる
ビジョナリー・カンパニー 時代を超える生存の原則
世界は感情で動く 行動経済学から見る脳のトラップ
原因と結果の法則
7つの習慣 人格主義の回復
ユダヤ人大富豪の教え
金持ち父さん貧乏父さん アメリカの金持ちが教えてくれるお金の哲学
さあ、才能に目覚めよう あなたの5つの強みを見出し、活かす
スタンフォードの自分を変える教室
天才！成功する人々の法則
仕事は楽しいかね
自助論
フロー体験　喜びの現象学
ビジネスマンの父より息子への30通の手紙
チーズはどこへ消えた
プロフェッショナルの条件
生き方 人間として一番大事な事
思考は現実化する
非常識な成功法則
ザ・ゴール
君主論
プロフェッショナル・マネジャー
小説でわかる名著 経営者の条件 人生を変えるドラッカー
小倉昌男 経営学
コトラーのマーケティング・マネジメント
ブルー・オーシャン戦略 競争のない世界を創造する
マッキンゼー式世界最強の仕事術
競争の戦略
フリーからお金を生みだす新戦略
イノベーションのジレンマ 技術革新が巨大企業を滅ぼすとき
ブラック・スワン 不確実性とリスクの本質
ウォール街のランダム・ウォーカー
リスク 神々への反逆
まぐれ 投資家はなぜ、運と実力を勘違いするのか
アニマルスピリット 人間の心理がマクロ経済を動かす
決算書がスラスラわかる 財務3表一体理解法
道は開ける
人を動かす
ザ・コピーライティング 心の琴線にふれる言葉の法則
影響力の武器 なぜ、人は動かされるのか
考具 考えるための道具、持っていますか
整理 HACKS
ロジカル・シンキング
入門 考える技術・書く技術 日本人のロジカルシンキング実践法
ザ・ゴール
ストレングスファインダー 2.0
ザ・コピーライティング 心の琴線にふれる言葉の法則
ロジカル・シンキング
スタンフォードの自分を変える教室
生き方 人間として一番大事な事
孫子
プロフェッショナルの条件
人を動かす
ブルー・オーシャン戦略 競争のない世界を創造する
ビジョナリー・カンパニー 時代を超える生存の原則
エッセンシャル思考 最少の時間で成果を最大にする
7つの習慣 人格主義の回復
金持ち父さん貧乏父さん アメリカの金持ちが教えてくれるお金の哲学
企業参謀 戦略的思考とはなにか
イノベーションのジレンマ 技術革新が巨大企業を滅ぼすとき
考具 考えるための道具、持っていますか
影響力の武器 なぜ、人は動かされるのか
HARD THINGS 答えがない難問と困難にきみはどう立ち向かうか
嫌われる勇気
アニマルスピリット 人間の心理がマクロ経済を動かす
失敗の本質 日本軍の組織論的研究
天才！成功する人々の法則
学びを結果に変えるアウトプット大全
7つの習慣 人格主義の回復
原因と結果の法則
自助論
LIFE SHIFT
ハイコンセプト「新しいこと」を考え出す人の時代
フリーからお金を生みだす新戦略
ブルー・オーシャン戦略 競争のない世界を創造する
ビジョナリー・カンパニー 時代を超える生存の原則
イノベーションのジレンマ 技術革新が巨大企業を滅ぼすとき
さあ、才能に目覚めよう あなたの5つの強みを見出し、活かす
プロフェッショナルの条件
仕事は楽しいかね
ぼくの人生はだれのもの？
天才！成功する人々の法則
モチベーション3.0 持続する「やる気!」をいかに引き出すか
デザイン思考が世界を変える
ザ・マインドマップ
あなたもいままでの10倍速く本が読める
イシューからはじめよ 知的生産の「シンプルな本質」
FACTFULNESS(ファクトフルネス) 10の思い込みを乗り越え、データを基に世界を正しく見る習慣
統計学が最強の学問である
プレゼンテーションZEN
マーケット感覚を身につけよう 「これから何が売れるのか?」わかる人になる5つの方法
フリーエージェント社会の到来 新装版—組織に雇われない新しい働き方
シェア 共有 からビジネスを生みだす新戦略
これからの「正義」の話をしよう
サピエンス全史
ホモ・デウス テクノロジーとサピエンスの未来
21世紀の資本
ストーリーとしての競争戦略 優れた戦略の条件
企業参謀 戦略的思考とはなにか
ザ・ゴール
急に売れ始めるにはワケがある ネットワーク理論が明らかにする口コミの法則
生産性 マッキンゼーが組織と人材に求め続けるもの
キャズム
ティール組織 マネジメントの常識を覆す次世代型組織の出現
金持ち父さんの若くして豊かに引退する方法
お金持ちになれる黄金の羽根の拾い方 知的人生設計のすすめ
「週4時間」だけ働く。
7つの習慣 人格主義の回復
人を動かす
道は開ける
影響力の武器 なぜ、人は動かされるのか
エッセンシャル思考 最少の時間で成果を最大にする
イシューからはじめよ 知的生産の「シンプルな本質」
ストーリーとしての競争戦略 優れた戦略の条件
これからの会社員の教科書
嫌われる勇気
坂の上の雲
LIFE SHIFT
苦しかったときの話をしようか
このまま今の会社にいていいのか？と一度でも思ったら読む 転職の思考法
金持ち父さん貧乏父さん アメリカの金持ちが教えてくれるお金の哲学
人を動かす
私はどうして販売外交に成功したのか
道をひらく
選択の科学
ハーバード流宴会術
動機づける力 モチベーション理論と実践
ネクスト・ソサエティー 歴史が見たことのない未来が始まる
やってのける 意志力を使わずに自分を動かす
ストーリーとしての競争戦略 優れた戦略の条件
経営戦略を問い直す
サラリーマン合気道 流されるから遠くに行ける
孫子
自分のアタマで考えよう
ザ・ミッション 人生の目的の見つけ方
生き方 人間として一番大事な事
世界は感情で動く 行動経済学から見る脳のトラップ
7つの習慣 人格主義の回復
金持ち父さん貧乏父さん アメリカの金持ちが教えてくれるお金の哲学
さあ、才能に目覚めよう あなたの5つの強みを見出し、活かす
スタンフォードの自分を変える教室
ブームを作る 人がみずから働く仕組み
エッセンシャル思考 最小の時間で成果を最大にする
競争の戦略
まぐれ 投資家はなぜ、運と実力を勘違いするのか
考具 考えるための道具、持っていますか
仕事も人間関係もうまくいく ANAの気づかい
ユダヤ人大富豪の教え
天才！成功する人々の法則
仕事は楽しいかね
入社1年目の教科書
入社1年目ビジネスマナーの教科書
プレゼン資料のデザイン図鑑
入社1年目のお金の教科書
世界一やさしい問題解決の授業 自分で考え、行動する力が身につく
世界一やさしい右脳型問題解決の授業
たった1日で即戦力になるExcelの教科書
地頭力を鍛える 問題解決に活かす フェルミ推定
100円のコーラを1000円で売る方法
世界で一番やさしい会議の教科書
原因と結果の法則
シェア 共有 からビジネスを生みだす新戦略
私らしく働くこと 自分らしく生きる 仕事のカタチ のつくり方
仕事のストレスが笑いに変わる！ サラリーマン大喜利
好かれる女は、感情の整理がうまい
感情の問題地図
女性が管理職になったら読む本
父が娘に語る 美しく、深く、壮大で、とんでもなくわかりやすい経済の話
働く女性ほんとの格差
思考は現実化する
職場のLGBT読本
ボクの彼氏はどこにいる
すべての知識を20字でまとめる 紙１枚！独学法
予定通り進まないプロジェクトの進め方
もし高校野球の女子マネージャーがドラッカーの『マネジメント』を読んだら
ルフィと白ひげ 信頼される人の条件
地頭力を鍛える 問題解決に活かす フェルミ推定
21世紀のビジネスにデザイン思考が必要な理由
リーダー3年目からの教科書
人生を変える習慣のつくり方
ロジカル・シンキング
頭がいい人の「論理思考」の磨き方
イシューからはじめよ 知的生産の「シンプルな本質」
グロービス MBA キーワード 図解 基本フレームワーク50
賢さをつくる
5W1Hの思考法
メタ思考トレーニング
アナロジー思考
直感と論理をつなぐ思考法
なぜ「戦略」で差がつくのか
戦略「脳」を鍛える
戦略思考コンプリートブック
戦略策定概論 企業戦略立案の理論と実際
戦略フレームワークの思考法
アイデアのつくり方
ずるい考え方 ゼロから始めるラテラルシンキング入門
考具 考えるための道具、持っていますか
答えはいつも、自分の枠の外にある！
仮説思考 BCG流 問題発見・解決の発想法
世界一やさしい問題解決の授業 自分で考え、行動する力が身につく
問題解決 あらゆる課題を突破する ビジネスパーソン必須の仕事
コンサルを超える 問題解決と価値創造の全技法
地頭力を鍛える 問題解決に活かす フェルミ推定
世界一やさしい右脳型問題解決の授業
会社では教えてもらえない 残業ゼロの人の段取りのキホン
仕事が速い人は、「これ」しかやらない ラクして速く成果を出す７の原則
なかなか自分で決められない人のための「決める」技術
ミスしても評価が高い人は、何をしているのか？
世界で一番やさしい会議の教科書
世界で一番やさしい会議の教科書 実践編
生産性 マッキンゼーが組織と人材に求め続けるもの
外資系コンサルの知的生産術 プロだけが知る「99の心得」 
担当になったら知っておきたい「プロジェクトマネジメント」実践講座
プロジェクトリーダーの教科書
抵抗勢力との向き合い方
マーケティングリサーチとデータ分析の基本
意思決定のための「分析の技術」 最大の経営成果をあげる問題発見・解決の思考法
武器としてのデータ分析力
それ、根拠あるの? と言わせない データ・統計分析ができる本
データ分析人材になる 目指すは「ビジネストランスレーター」
入門 考える技術・書く技術 日本人のロジカルシンキング実践法
伝わるデザインの基本 増補改訂版 よい資料を作るためのレイアウトのルール
社内プレゼンの資料作成術
ロジカル・プレゼンテーション 自分の考えを効果的に伝える戦略コンサルタントの「提案の技術」
1分で話せ 世界のトップが絶賛した大事なことだけシンプルに伝える技術
ザ・ファシリテーター
問いのデザイン 創造的対話のファシリテーション
ワークショップデザイン
ファシリテーターの道具箱 組織の問題解決に使えるパワーツール49
ファシリテーション・グラフィック 議論を「見える化」する技法 
イノベーション・ファシリテーター 3カ月で社会を変えるための思想と実践
最高のリーダー、マネジャーがいつも考えているたったひとつのこと
ついていきたい と思われるリーダーになる51の考え方
WHYから始めよ! インスパイア型リーダーはここが違う
心理的安全性のつくりかた
自分の頭で考えて動く部下の育て方 上司1年生の教科書
困った部下が最高の戦力に化けるすごい共感マネジメント
コーチング・マネジメント 人と組織のハイパフォーマンスをつくる
ひとりでも部下のいる人のための世界一シンプルなマネジメント術 3分間コーチ
対話型マネジャー 部下のポテンシャルを引き出す最強育成術
マネジメント エッセンシャル版 基本と原則
ビジョナリー・カンパニー 時代を超える生存の原則
競争の戦略
企業戦略論
イノベーションのジレンマ 技術革新が巨大企業を滅ぼすとき
ブルー・オーシャン戦略 競争のない世界を創造する
ストーリーとしての競争戦略 優れた戦略の条件
CSV経営戦略 本業での高収益と、社会の課題を同時に解決する
ビジネスモデル思考法 ストーリーで読む「儲ける仕組み」のつくり方
ゼロからつくるビジネスモデル
ビジネスモデルナビゲーター
はじめての社内起業 「考え方・動き方・通し方」 実践ノウハウ
新規事業の実践論
組織設計概論 戦略的組織制度の理論と実際
組織戦略の考え方 企業経営の健全性のために
マーケティングとは組織革命である
コトラーのマーケティング・マネジメント
ポジショニング戦略
マーケティングプロフェッショナルの視点 明日から仕事がうまくいく24のヒント
たった一人の分析から事業は成長する 実践 顧客起点マーケティング
USJを劇的に変えた、たった1つの考え方 成功を引き寄せるマーケティング入門
PGウェイ 世界最大の消費財メーカーPGのブランディングの軌跡
確率思考の戦略論 USJでも実証された数学マーケティングの力
データ・ドリブン・マーケティング 最低限知っておくべき15の指標
コトラーのマーケティング・マネジメント
ジョブ理論 イノベーションを予測可能にする消費のメカニズム
プロダクトマネージャーの教科書
デジタル時代の基礎知識 『ブランディング』 「顧客体験」 で差がつく時代の新しいルール
グローバル企業に学ぶブランドマーケティング
ブランド戦略全書
本当のブランド理念について語ろう
ブランド論 無形の差別化を作る20の基本原則
エッセンシャル戦略的ブランド・マネジメント 第4版
戦略的ブランド経営
ブランディング７の原則 成長企業の世界標準ノウハウ
決算書がスラスラわかる 財務3表一体理解法
ビジネススクールで身につける会計力と戦略思考力
ざっくり分かるファイナンス 経営センスを磨くための財務
バリュエーションの教科書
会計参謀 会計を戦略に活用する
7つの習慣 人格主義の回復
道をひらく
論語と算盤
思考は現実化する
原因と結果の法則
仕事は楽しいかね
小さいことにくよくよするな
人を動かす
企業参謀 戦略的思考とはなにか
マネジメント エッセンシャル版 基本と原則
ビジョナリー・カンパニー
ディズニーCEOが実践する10の原則
両利きの経営
マネジメントへの挑戦
コトラーのマーケティング・マネジメント
競争の戦略
影響力の武器 なぜ、人は動かされるのか
キャズム
イノベーションのジレンマ 技術革新が巨大企業を滅ぼすとき
ザ・コピーライティング 心の琴線にふれる言葉の法則
ポジショニング戦略
なぜこの店で買ってしまうのか
エスキモーに氷を売る 魅力のない商品を、いかにセールスするか
確率思考の戦略論
ザ・コピーライティング 心の琴線にふれる言葉の法則
ウォートン流 人生のすべてにおいてもっとトクをする新しい交渉術
グロービス MBA キーワード 図解 基本フレームワーク50
シュガーマンのマーケティング30の法則
影響力の武器 なぜ、人は動かされるのか
影響力の法則 現代組織を生き抜くバイブル
ストーリーとしての競争戦略 優れた戦略の条件
ロングテール 売れない商品 を宝の山に変える新戦略
HARD THINGS 答えがない難問と困難にきみはどう立ち向かうか
失敗の本質 日本軍の組織論的研究
稲盛和夫の実学 経営と会計
プロフェッショナル・マネジャー
孫子
思考は現実化する
7つの習慣 人格主義の回復
仕事は楽しいかね
プロフェッショナルの原点
Q思考 シンプルな問いで本質をつかむ思考法
ブラック・スワン 不確実性とリスクの本質
ビジネス名著大全
競争の戦略
競争優位の終焉
コア・コンピタンス経営
異業種競争戦略
ブルー・オーシャン戦略 競争のない世界を創造する
プラットフォーム戦略
一回のお客を一生の顧客にする法
破天荒！
マーベリック・カンパニー
顧客第2主義
競争の戦略
世界の経営学者はいま何を考えているのか
良い戦略 悪い戦略
トレード・オフ
戦略「脳」を鍛える
経営は「実行」
戦略を、実行できる組織、実行できない組織
戦略と実行
マッキンゼー流 最高の社風の作り方
人材を活かす企業
人事評価はもういらない
全員経営
現場力を鍛える
なぜ、わかっていても実行できないのか
現場からオフィスまで、全社で展開するトヨタの自工程完結
GE式ワークアウト
失敗学のすすめ
名経営者が、なぜ失敗するのか
なぜリーダーは「失敗」を認められないのか
ビジネスで失敗する人の10の法則
失敗の本質 日本軍の組織論的研究
不確実性のマネジメント
予測できた危機をなぜ防げなかったのか
パラダイムの魔力
インテル戦略転換
なぜ危機に気づけなかったのか
組織の衰退
ビジョナリー・カンパニー
V字回復の経営
企業変革力
ディズニー 7つの法則
最高のサービスを実現するリーダーシップ
成果を出す企業はどう考えどう動くのか
コア事業進化論
WHYから始めよう
巨像も踊る
ルネッサンス
スターバックス再生物語
無印良品は、仕組みが9割
ビジョナリー・カンパニー
ビジョナリー・カンパニー
ビジョナリー・カンパニー
君臨する企業の6つの法則
現代の経営
現代の経営
場の論理とマネジメント
学習する組織
コトラーのマーケティング3.0
シェア
フリー
イノベーションの解
リバース・イノベーション
オープンイノベーションの教科書
成功読書術
人を動かす
人間性の心理学
影響力の武器 なぜ、人は動かされるのか
思考と行動における言語
ホモ・ルーデンス
情報の文明学
私はどうして販売外交に成功したか
風姿花伝
君主論
ビジネスは人なり投資は価値なり
相場師一代
人生と財産
人間における勝負の研究
もっと深く、もっと楽しく
世紀の相場師ジェジー・リバモア
ビジョナリー・カンパニー
プロフェッショナル・マネジャー
ブーメランの法則
小倉昌男 経営学
経営に終わりはない
真実が人を動かす
ビジネスマンの父より息子への30通の手紙
学問のすゝめ
アラン人生論集
道をひらく
小説でわかる名著 経営者の条件 人生を変えるドラッカー
7つの習慣 人格主義の回復
ザ・ゴール
古代への情熱
あらすじで読む 世界のビジネス名著
現代の経営
入門 考える技術・書く技術 日本人のロジカルシンキング実践法
イノベーションのジレンマ 技術革新が巨大企業を滅ぼすとき
イノベーションへの解
ベンチャー創造の理論と戦略
ハーバードで教える人材戦略
組織行動のマネジメント
コンピテンシー・マネジメントの展開
最強組織の法則
企業変革力
コトラーのマーケティング・マネジメント
顧客ロイヤルティのマネジメント
サービスマーケティング原理
ブランド・エクイティ戦略
企業分析入門
企業価値評価
コーポレート・ファイナンス
ABCマネジメント革命
リアル・オプション
リスク 神々への反逆
競争の戦略
競争優位の戦略
コア・コンピタンス経営
知識創造企業
ゲーム理論で勝つ経営
ビジョナリー・カンパニー
キャプランとノートンの戦略バランスト・スコアカード
世界のエリートが学んでいるMBA必読書50冊を1冊にまとめてみた
競争の戦略
競争戦略論
戦略サファリ
競争優位の終焉
良い戦略 悪い戦略
ゲーム理論で勝つ経営
コア・コンピタンス経営
企業戦略論
ダイナミック・ケイパビリティ戦略
知識創造企業
顧客ロイヤリティのマネジメント
ネット・プロモーター経営
キャズム
イノベーションのジレンマ 技術革新が巨大企業を滅ぼすとき
イノベーションへの解
ジョブ理論 イノベーションを予測可能にする消費のメカニズム
企業とは何か
アントレプレナーの教科書
リーン・スタートアップ
トヨタ生産方式
アダプト思考
ZERO to ONE
ブルー・オーシャン戦略 競争のない世界を創造する
ブルー・オーシャン・シフト
発想する会社！
メイカーズ
ブランド優位の戦略
価格の掟
フリー
パーミッション・マーケティング
戦略販売
エクセレント・カンパニー
ビジョナリー・カンパニー
ビジョナリー・カンパニー
日本の優秀企業研究
ティール組織 マネジメントの常識を覆す次世代型組織の出現
企業変革力
企業文化 生き残りの指針
巨象も踊る
スターバックス再生物語
成功はゴミ箱の中に
幸之助論
人を伸ばす能力
フロー体験入門
GIVE & TAKE 「与える人」こそ成功する時代
予想どおりに不合理
選択の科学
影響力の武器 なぜ、人は動かされるのか
さあ、才能に目覚めよう あなたの5つの強みを見出し、活かす
リーディングス ネットワーク論
"""

books = {}
for book in data.split("\n"):
    if book in books:
        books[book] += 1
    else:
        books[book] = 1

path = "result.csv"
with open(path, "w", encoding="UTF-8") as f:
    for key, value in books.items():
        f.write(str(f"{value},{key}\n"))
